


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСуммуТЧТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСуммуТЧТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Цена = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Сумма / ТекСтрока.Количество);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	Объект.ОбщаяСумма = Объект.Товары.Итог("Сумма");
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции
&НаКлиенте
Процедура РасчитатьСуммуТЧТовары()
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры
#КонецОбласти

